# PyBer Challenge
## Objective
Determine if there is a correlation between the average fare and the total rides for each city type for the individual scatter plots, and if there is any statistical significance between the different city types for each box-and-whisker plot.

## Tasks
1. Create a PyBer Summary DataFrame for each city type:
    * Total Rides
    * Total Drivers
    * Total Fares
    * Average Fare per Ride
    * Average Fare per Driver
2. Create a Multiple-Line Plot for the sum of the fares for each city type.

### Notebook Setup

In [1]:
# Add Matplotlib inline magic command
%matplotlib inline

# Setup dependencies
import matplotlib.pyplot as plt
import pandas as pd
import os
import numpy as np

In [2]:
# Data files to load
city_data_to_load = os.path.join("Resources", "city_data.csv")
ride_data_to_load = os.path.join("Resources", "ride_data.csv")

# Read data files and store them in a Pandas DataFrame
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Data Cleaning

In [3]:
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [4]:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [5]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [6]:
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [7]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [8]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [9]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

### Merge DataFrames

In [10]:
# Combine data into a single data
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])
pyber_data_df.dtypes

city             object
date             object
fare            float64
ride_id           int64
driver_count      int64
type             object
dtype: object

## Task 1: Create PyBer Summary DataFrame

### Calculate the total number of rides in each City Type

In [11]:
total_rides_by_city_type = pyber_data_df.groupby(["type"]).count()["ride_id"]
total_rides_by_city_type

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

### Calculate the total number of drivers in each City Type

In [12]:
total_drivers_by_city_type = city_data_df.groupby(["type"]).sum()["driver_count"]
total_drivers_by_city_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

### Calculate the total fares in each City Type

In [13]:
total_fares_by_city_type = pyber_data_df.groupby(["type"]).sum()["fare"]
total_fares_by_city_type

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

### Calculate the average fare per ride in each City Type

In [14]:
avgfares_perride_by_city_type = total_fares_by_city_type / total_rides_by_city_type
avgfares_perride_by_city_type

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

### Calculate the average fare per driver in each City Type

In [15]:
avgfare_perdriver_by_city_type = total_fares_by_city_type / total_drivers_by_city_type
avgfare_perdriver_by_city_type

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

### Remove the index name

In [16]:
total_rides_by_city_type.index.name = None
total_rides_by_city_type

Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [17]:
total_drivers_by_city_type.index.name = None
total_drivers_by_city_type

Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [18]:
total_fares_by_city_type.index.name = None
total_fares_by_city_type

Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

### Build the PyBer Summary DataFrame

In [19]:
summary_df = pd.DataFrame()

summary_df["Total Rides"] = total_rides_by_city_type
summary_df["Total Drivers"] = total_drivers_by_city_type
summary_df["Total Fares"] = total_fares_by_city_type
summary_df["Average Fare per Ride"] = avgfares_perride_by_city_type
summary_df["Average Fare per Driver"] = avgfare_perdriver_by_city_type

summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [20]:
summary_df.dtypes

Total Rides                  int64
Total Drivers                int64
Total Fares                float64
Average Fare per Ride      float64
Average Fare per Driver    float64
dtype: object

### Format the PyBer Summary DataFrame

In [21]:
summary_df["Total Rides"] = summary_df["Total Rides"].map("{:,}".format)
summary_df["Total Drivers"] = summary_df["Total Drivers"].map("{:,}".format)
summary_df["Total Fares"] = summary_df["Total Fares"].map("${:,.2f}".format)
summary_df["Average Fare per Ride"] = summary_df["Average Fare per Ride"].map("${:.2f}".format)
summary_df["Average Fare per Driver"] = summary_df["Average Fare per Driver"].map("${:.2f}".format)

summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Task 2: Create a Multiple-Line Plot for the Sum of the Fares for Each City Type

### 1. Rename the columns in the PyBer Data DataFrame.

In [22]:
pyber_data_df = pyber_data_df.rename(columns =
                                     {"city": "City",
                                     "date": "Date", 
                                     "fare": "Fare", 
                                     "ride_id": "Ride Id",
                                     "driver_count": "No. Drivers",
                                     "type": "City Type"})

pyber_data_df

,City,Date,Fare,Ride Id,No. Drivers,City Type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,2019-04-29 17:04:39,13.38,8550365057598,6,Rural
2371,Lake Latoyabury,2019-01-30 00:05:47,20.76,9018727594352,2,Rural
2372,North Jaime,2019-02-10 21:03:50,11.11,2781339863778,1,Rural
2373,West Heather,2019-05-07 19:22:15,44.94,4256853490277,4,Rural
2374,Newtonview,2019-04-25 10:20:13,55.84,9990581345298,1,Rural

In [23]:
pyber_data_df.dtypes

City            object
Date            object
Fare           float64
Ride Id          int64
No. Drivers      int64
City Type       object
dtype: object

### 2. Set the index column to the Date Column.

In [24]:
pyber_data_df.set_index(pyber_data_df["Date"], inplace=True)

In [25]:
pyber_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2375 entries, 2019-01-14 10:14:22 to 2019-04-25 10:20:13
Data columns (total 6 columns):
City           2375 non-null object
Date           2375 non-null object
Fare           2375 non-null float64
Ride Id        2375 non-null int64
No. Drivers    2375 non-null int64
City Type      2375 non-null object
dtypes: float64(1), int64(2), object(3)
memory usage: 129.9+ KB

### 3. Create a new DataFrame for fares and include only the Date, City Type, and Fare columns using the copy() method on the merged DataFrame.

In [64]:
pyber_cities_fares= pyber_data_df[["Date", "City Type", "Fare"]].copy()
pyber_cities_fares.head(10)

                                    Date City Type   Fare
Date
2019-01-14 10:14:22  2019-01-14 10:14:22     Urban  13.83
2019-03-04 18:24:09  2019-03-04 18:24:09     Urban  30.24
2019-02-24 04:29:00  2019-02-24 04:29:00     Urban  33.44
2019-02-10 23:22:03  2019-02-10 23:22:03     Urban  23.44
2019-03-06 04:28:35  2019-03-06 04:28:35     Urban  34.58
2019-03-11 12:26:48  2019-03-11 12:26:48     Urban   9.52
2019-02-27 11:17:56  2019-02-27 11:17:56     Urban  43.25
2019-04-26 00:43:24  2019-04-26 00:43:24     Urban  35.98
2019-01-08 03:28:48  2019-01-08 03:28:48     Urban  35.09
2019-03-09 06:26:29  2019-03-09 06:26:29     Urban  42.81

### 4. Drop the extra Date column.

In [65]:
pyber_cities_fares.drop(["Date"], axis=1, inplace=True)
pyber_cities_fares.head(10)

                    City Type   Fare
Date
2019-01-14 10:14:22     Urban  13.83
2019-03-04 18:24:09     Urban  30.24
2019-02-24 04:29:00     Urban  33.44
2019-02-10 23:22:03     Urban  23.44
2019-03-06 04:28:35     Urban  34.58
2019-03-11 12:26:48     Urban   9.52
2019-02-27 11:17:56     Urban  43.25
2019-04-26 00:43:24     Urban  35.98
2019-01-08 03:28:48     Urban  35.09
2019-03-09 06:26:29     Urban  42.81

### 5. Set the index to the datetime data type.

In [66]:
pyber_cities_fares.index = pd.to_datetime(pyber_data_df.index)
pyber_cities_fares.head(10)

                    City Type   Fare
Date
2019-01-14 10:14:22     Urban  13.83
2019-03-04 18:24:09     Urban  30.24
2019-02-24 04:29:00     Urban  33.44
2019-02-10 23:22:03     Urban  23.44
2019-03-06 04:28:35     Urban  34.58
2019-03-11 12:26:48     Urban   9.52
2019-02-27 11:17:56     Urban  43.25
2019-04-26 00:43:24     Urban  35.98
2019-01-08 03:28:48     Urban  35.09
2019-03-09 06:26:29     Urban  42.81

### 6. Check the DataFrame using the info() method to make sure the index is a datetime data type.

In [67]:
pyber_cities_fares.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2375 entries, 2019-01-14 10:14:22 to 2019-04-25 10:20:13
Data columns (total 2 columns):
City Type    2375 non-null object
Fare         2375 non-null float64
dtypes: float64(1), object(1)
memory usage: 55.7+ KB

### 7. Calculate the sum() of fares by the type of city and date using groupby() to create a new DataFrame.

In [68]:
sum_fares = pyber_cities_fares.groupby(["City Type", "Date"]).sum()[["Fare"]]
sum_fares.head(10)

                                Fare
City Type Date
Rural     2019-01-01 09:45:36  43.69
          2019-01-02 11:18:32  52.12
          2019-01-03 19:51:01  19.90
          2019-01-04 03:31:26  24.88
          2019-01-06 07:38:40  47.33
          2019-01-08 06:19:45  19.39
          2019-01-09 15:30:35  31.84
          2019-01-11 04:39:27  16.42
          2019-01-14 07:09:17  18.05
          2019-01-14 15:58:48  54.10

In [69]:
sum_fares_df = pd.DataFrame(sum_fares)
sum_fares_df.head(10)

                                Fare
City Type Date
Rural     2019-01-01 09:45:36  43.69
          2019-01-02 11:18:32  52.12
          2019-01-03 19:51:01  19.90
          2019-01-04 03:31:26  24.88
          2019-01-06 07:38:40  47.33
          2019-01-08 06:19:45  19.39
          2019-01-09 15:30:35  31.84
          2019-01-11 04:39:27  16.42
          2019-01-14 07:09:17  18.05
          2019-01-14 15:58:48  54.10

### 8. Reset the index, which is needed for Step 10.

In [54]:
#sum_fares.index = pd.to_datetime(pyber_cities_fares.index)
#sum_fares.head(10)

In [70]:
sum_fares_df = sum_fares_df.reset_index()
sum_fares_df.head(10)

  City Type                Date   Fare
0     Rural 2019-01-01 09:45:36  43.69
1     Rural 2019-01-02 11:18:32  52.12
2     Rural 2019-01-03 19:51:01  19.90
3     Rural 2019-01-04 03:31:26  24.88
4     Rural 2019-01-06 07:38:40  47.33
5     Rural 2019-01-08 06:19:45  19.39
6     Rural 2019-01-09 15:30:35  31.84
7     Rural 2019-01-11 04:39:27  16.42
8     Rural 2019-01-14 07:09:17  18.05
9     Rural 2019-01-14 15:58:48  54.10

### 9. Create a pivot table DataFrame with the Date as the index and columns = 'City Type' with the Fare for each Date in each row. Note: There will be NaNs in some rows, which will be taken care of when you sum based on the date.

In [74]:
sum_fares_pivot = sum_fares_df.pivot(index="Date", columns="City Type")["Fare"]
sum_fares_pivot.head(10)

City Type            Rural  Suburban  Urban
Date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
2019-01-01 09:45:36  43.69       NaN    NaN
2019-01-01 12:32:48    NaN     25.56    NaN
2019-01-01 14:40:14    NaN       NaN   5.42
2019-01-01 14:42:25    NaN       NaN  12.31
2019-01-01 14:52:06    NaN     31.15    NaN

### 10. Create a new DataFrame from the pivot table DataFrame on the given dates [Jan. 1, 2019 to Apr. 28, 2019] using loc.

In [76]:
fares_Jan_April = sum_fares_pivot.loc['2019-01-01':'2019-04-28']
fares_Jan_April

City Type            Rural  Suburban  Urban
Date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2019-04-28 14:28:36    NaN       NaN  11.46
2019-04-28 16:29:16    NaN       NaN  36.42
2019-04-28 17:26:52    NaN       NaN  31.43
2019-04-28 17:38:09    NaN     34.87    NaN
2019-04-28 19:35:03    NaN     16.96    NaN

[2196 rows x 3 columns]

### 11. Create a new DataFrame by setting the DataFrame you created in Step 10 with resample() in weekly bins, and calculate the sum() of the fares for each week.

In [77]:
weekly_fares_df = fares_Jan_April.resample("W").sum()
weekly_fares_df

City Type    Rural  Suburban    Urban
Date
2019-01-06  187.92    721.60  1661.68
2019-01-13   67.65   1105.13  2050.43
2019-01-20  306.00   1218.20  1939.02
2019-01-27  179.69   1203.28  2129.51
2019-02-03  333.08   1042.79  2086.94
2019-02-10  115.80    974.34  2162.64
2019-02-17   95.82   1045.50  2235.07
2019-02-24  419.06   1412.74  2466.29
2019-03-03  175.14    858.46  2218.20
2019-03-10  303.94    925.27  2470.93
2019-03-17  163.39    906.20  2044.42
2019-03-24  189.76   1122.20  2368.37
2019-03-31  199.42   1045.06  1942.77
2019-04-07  501.24   1010.73  2356.70
2019-04-14  269.79    784.82  2390.72
2019-04-21  214.14   1149.27  2303.80
2019-04-28  191.85   1357.75  2238.29